{
    "command_group": "az monitor log-analytics",
    "description": "Manage Azure log analytics.",
    "status": "GA",
    "commands": [
        {
            "name": "az monitor log-analytics query",
            "summary": "Query a Log Analytics workspace.",
            "syntax": "az monitor log-analytics query --analytics-query\n                               --workspace\n                               [--timespan]\n                               [--workspaces]",
            "required_parameters": [
                "--analytics-query",
                "--workspace -w"
            ],
            "optional_parameters": [
                "--timespan -t",
                "--workspaces"
            ],
            "examples": [
                "az monitor log-analytics query -w workspace-customId --analytics-query \"AzureActivity | summarize count() by bin(TimeGenerated, 1h)\" -t P3DT12H",
                "az monitor log-analytics query -w workspace-customId --analytics-query $(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)"
            ]
        }
    ]
}